---
kind: type
id: T:Autodesk.Revit.DB.Structure.ReinforcementData
source: html/887493aa-8de4-c68e-d246-9ecb849ae641.htm
---
# Autodesk.Revit.DB.Structure.ReinforcementData

Abstract class for various reinforcement data

## Syntax (C#)
```csharp
public class ReinforcementData : IDisposable
```